[
  {
    "id": 1,
    "text": "looks like we officially found the single greatest use case of ai.\nnope it's not optimizing workflows, starting [ENTITY] companies, or even no-code tools.\nit's a fake granny spamming scammers.\ni stumbled across this video of an [LOCATION]-generated grandma absolutely destroying scam callers and nearly spit out my coffee laughing.\nwe're all out here trying to build the next big AI startup while grandma is over there putting her digital foot down on people trying to steal her imaginary retirement fund.\nthis is the kind of chaotic energy we need more of in the tech world.\nimagine the possibilities... AI grandmas protecting real grandmas from tech scams? it's like digital karma in the most beautiful way.\nhope everyone has a great day, especially ai granny.\n🎥 [PERSON]"
  },
  {
    "id": 2,
    "text": "good morning, you delightful weirdos of [LOCATION]. 👋\non a platform full of try-hards, I’m on a search for the biggest, boldest, most unhinged weirdos.\nThe brave pioneers who refuse to conform to the “professionalism” of [ORG] and instead inject their real, raw, and completely unfiltered personality.\nOh, and memes. Lots of memes.\nWith more ChatGPT-generated garbage flooding our feeds, the only way to stand out is by being extra human. Weird wins.\nSo far, I’ve got [PERSON] [PERSON] at the top of my list.\nBut I need more test subjects for my ongoing experiment in becoming unhinged on [LOCATION].\nWho’s the weirdest, most unapologetically authentic person you know on this side of the internet?\ntag them below. 👇"
  },
  {
    "id": 3,
    "text": "[ENTITY], i was fired from my role at beehiiv.\nand to be honest… i’m relieved.\nnot because i didn’t love the role. i did. i’ve got nothing but respect for the beehiiv team and truly believe in the product. my time there was meaningful and full of learning.\nbut i’m relieved because, deep down, i’ve spent [ENTITY] at both ramp and beehiiv convincing myself i’d return to the founder seat someday.\nand in the process, i kept putting off what i love most: building.\nnow, i believe this is g-d giving me a clear signal. the time is now.\nso what’s next?\nb2b saas: i’ve already started working on a new saas product (yes, it’s related to linkedin [PERSON]).\nthe goal is to launch in [ENTITY] to [ENTITY] to [ENTITY] businesses, gather feedback, and scale quickly from there.\nthe front end is built, and now i’m looking to partner with automation engineers or developers to help on the scraping and backend side.\nghostwriting for founders: to generate some near-term cash flow, i’ll be working with a select few founders on building their personal brand through linkedin and newsletters.\nif you’re looking to build in public but don’t know where to start, let’s chat.\nbuilding in public: i’ll be documenting the entire journey. the wins, the setbacks, the real-time lessons. [ENTITY]. also have my linkedin hunger games to keep track of!\nalways remember: there’s a positive in every situation.\nfor me, this marks the beginning of a new chapter. entrepreneurship.\nmy goal is to never have to work for a company again.\nlet’s build!\n[PERSON] ill be documenting my whole journey here, [LINK]"
  },
  {
    "id": 4,
    "text": "some of us treat linkedin like a networking event while others treat it like a game of hide and seek.\nnot sharing your personal and professional journey on [ORG] is akin to some of these hiding spots, like hiding in a secret door or even a hidden underground garage.\ni see so many brilliant entrepreneurs playing the world's greatest game of hide and seek with their audience.\nnow more than ever, people care more about you and your story than your fancy tech stack and your brand's mission statement.\ni've talked with [ENTITY] of founders who finally stopped hiding and embraced building in public. the ones who share their journey through consistent linkedin posts and newsletters are connecting with customers, users, and investors at [ENTITY] the speed.\nthe best founders aren't hiding in walls, they're standing on them, waving their arms, and saying \"hey, this is what we're building!\". they are getting dms and email replies [ENTITY] that lead to real quantifiable opportunities and revenue.\ni'm looking to help [ENTITY] founder come out of hiding with some linkedin + newsletter magic. know someone who needs this? tag them below and let’s stop playing hide and seek.\np.s. for those ready to stop hiding, the linkedin hunger games ([ENTITY] posting challenge with a twist) has [ENTITY]+ participants and [ENTITY] in the pot. slide into my dms to join the party.\n[PERSON]: [HANDLE]"
  },
  {
    "id": 5,
    "text": "does anyone listen to airport announcements anymore?\nsitting in an airport as im writing this and i cannot wait to return home.\nsee you soon, [PRODUCT]🇱\nhope everyone has [ENTITY].\noh, and start a newsletter 💪🏼"
  },
  {
    "id": 6,
    "text": "Well, it's official... I've found the fun side of [LOCATION].\n[ENTITY], I put out a call to find the weirdos on this platform...\n[ENTITY] nominations later, I now realize I wildly underestimated just how many of you exist.\nNot to mention all the self-proclaimed weirdos sliding into my DMs.\nYou all are even weirder than I thought possible—and I mean that as the highest compliment.\nThe status quo of [LOCATION] is changing rapidly.\nOver [ENTITY], I'll be sharing:\nMy best insights from this weird and wonderful corner of the platform\nThe funniest moments that had me literally laughing at my desk\nThe most unhinged (yet somehow still appropriate) behavior that proves authenticity wins\nconnect with me to be a part of the revolution 🤝\nLinkedIn doesn’t have to be boring corporate speak and [LOCATION]-generated platitudes.\nLet’s have ourselves [ENTITY]. likelovecelebrate"
  },
  {
    "id": 7,
    "text": "sometimes our most firmly held beliefs get flipped upside down.\ni just watched a turtle break the sound barrier to obliterate a crab in [ENTITY].\nmy entire childhood was a lie. turtles aren't slow – they're strategic assassins playing the long game.\nthis got me thinking about another \"common wisdom\" myth we've all heard: email is dying in the social media era.\nplot twist: email is thriving more than ever.\nbe honest with me... how many times have you checked your inbox [ENTITY]? how many email addresses are you actively juggling?\nexactly.\nemail isn't just surviving, it's the backbone of our digital lives. while we're all doom-scrolling on social, our inboxes keep filling up with the stuff that actually matters.\nspeaking of email dominance, massive shoutout to our beehiiv squad for crushing it and officially hitting $[ENTITY]M ARR :)\nturns out turtles and email have something in common – they're both deceptively powerful and here for the long haul."
  },
  {
    "id": 8,
    "text": "apparently we've all been handling bugs wrong our entire lives...\nofficially a month into building [ORG] and i'm realizing [ENTITY] trait every early-stage founder needs:\nthe ability to solve problems in completely unexpected and creative ways.\neveryone's out here with bug spray and fancy zappers. meanwhile this person just holds up their chameleon and lets nature do its thing.\nthat's exactly what im trying to do with employee advocacy.\nlegacy platforms are trying to force the issue with corporate tools and top-down mandates.\nrallyup is the chameleon. natural, effective, and actually kinda fun to watch.\nthe best solutions are often the ones nobody sees coming.\nwho else is solving old problems in weird new ways?\n🎥 VC: Shelbywalterr"
  },
  {
    "id": 9,
    "text": "so, I accidentally started a revolution on linkedin.\nand [ENTITY] is the day I am launching it to the public, buckle up.\nbut [ENTITY] story time:\n[ENTITY] I saw a linkedin post that actually made me laugh out loud.\nit was from my fellow weirdo, [PERSON] who begged us to embrace our weirdness on this platform.\nAs someone who has been active on linkedin for [ENTITY], this post resonated with me deeply.\nI decided to embrace my weirdness and the results I saw were crazy.\nI shot jillian a dm and we got on a call.\nI told her it's time to build something for the weirdos of linkedin.\nI knew the combination of my newsletter skills (shoutout beehiiv, the best newsletter platform In the world) with [PERSON]'s content skills were a perfect combination.\nso in [ENTITY], I built a fully functioning newsletter, a beautiful website, and we were off to the races.\nwe low-key even got a mention from [ORG] in their newsletter [ENTITY] (mama, I made it).\n[ENTITY] is [ENTITY] we are officially launching [ORG].\nA newsletter/global revolution that is here to:\nTeach you how to break through your blocks and get weird online\n[ORG] your posts by learning from the content that’s blowing up\nCreate a community of people who are done being professional robots, and want to hold hands and be real together online\njoin the fun here - [LINK]\ntag a friend of yours that belongs on this side of the algorithm and while you're at it drop a solid meme.\nSee you on the other side brave pioneers. 🤝"
  },
  {
    "id": 10,
    "text": "when we witness something extraordinary, we should share it right?\ni absolutely love this video of a dog shredding on a skateboard like a canine [PERSON]. many of us go through life hoping to see something that genuinely surprises us. This little [ENTITY]-legged daredevil delivered that in spades.\ni'm not even a \"dog person\" or particularly into skateboarding, but excellence transcends preferences, doesn't it?\nanyone else think there should be a newsletter dedicated to dogs with remarkable talents? i have a feeling it would find an audience.\npet parents would eat it up for breakfast, lunch, and dinner.\nof course, only if it's built on beehiiv.\n[PERSON]: [HANDLE]"
  },
  {
    "id": 11,
    "text": "after getting fired [ENTITY], i’m giving myself [ENTITY] to build a solo-founded, bootstrapped business to [ENTITY].\nno fluff. no hiding. just a full-on masterclass in building in public.\nwhether i crash and burn or actually pull it off, it’s all gonna be here - live, for the linkedin universe to watch.\ni’m calling it: fired to acquired.\n[ENTITY] is [ENTITY], and here’s what went down:\nfinished vibe-coding my full front end\nhired an engineer to build the mvp (backend + all)\nopened my business bank account\nbooked [ENTITY] meetings with potential launch customers/partners\ni can already tell - this is going to be one of the hardest and most rewarding things i’ve ever done.\nbut the time is now. and i’m taking my shot.\nlet’s go.\n[PERSON] ill be documenting my whole journey here, [LINK]"
  },
  {
    "id": 12,
    "text": "[ENTITY] after being fired, i'm launching my startup to the world.\nintroducing RallyUp: a platform for companies to create, automate, and track linkedin posting competitions that boost reach, culture, and recruiting.\nlaunching [ENTITY] with [ENTITY] private beta partners (almost at capacity) but room for [ENTITY] more all-star teams.\nif you miss out on the [ENTITY] cohort, i'm opening up to [ENTITY] companies for our [ORG] challenge in [ENTITY].\nlearn more + get your company involved here → [LINK]\nwhy now? trust for brands is at an all-time low. companies investing in employee-led growth have an unfair competitive advantage.\n• [ENTITY] of people trust employee posts over branded ones • employee content drives [ENTITY] more engagement than brand content • [ENTITY] of job seekers research employers on social media\nand guess what? it costs a fraction of other marketing costs. early teams get my hands-on expertise guiding them through the process.\ni've never been more bullish on linkedin. it's not cringe anymore, it's a goldmine for companies.\nnow why me?\ni saw employee-led growth work magic at both ramp and beehiiv ([ENTITY] companies crushing this strategy).\nin [ENTITY] i've generated [ENTITY] impressions. so i know a bit about how this works.\ni also launched my very own linkedin [ENTITY] challenge with people all over the world posting consistently on linkedin. everyday in our groupchat there are more and more wins.\nlastly, i just got fired and am now all in.\nnow friends and strangers of linkedin, please do me a solid.\nso i can prove to my father-in-law that entrepreneur doesn't mean unemployed, comment a company/team/person that would benefit from this 👇\nall gas. no breaks. hashtag#firedtoacquired stay building, alec"
  },
  {
    "id": 13,
    "text": "i just raised a pre-seed round for [ORG] and i'm hiring.\nhere's how i went from fired to funded in [ENTITY].\nfor those following the journey: [ENTITY] i was let go from beehiiv. instead of hunting for a job, i decided to bet on myself.\ni was planning on bootstrapping, starting with a services model and some early revenue.\nthen something unexpected happened...\nRallyUp resonated way harder than i anticipated. teams actually got excited about turning employees into their best marketing channel. startups and fortune [PRODUCT] started reaching out asking when they could sign up.\nwhen [PERSON] from [ORG] reached out saying he saw the [ENTITY] opportunity too, i knew it was time to move faster.\n[PERSON] is incredibly bright and strategic, and i couldn’t be more excited to partner with him. [ORG] has a strong track record of picking winners, having invested early in companies like [ORG], Expel, and more.\nand now for everyone keeping score at home... raising money isn't the goal. building an incredible product that delivers real value is.\nand to do that even faster, i'm hiring an all-star engineer.\nnot looking for someone who just codes. i need someone who will:\nshape the product roadmap alongside me\nbring their own ideas and vision to the table\nthink about customers and the business, not just the code\nideally someone passionate about social media\nwe're offering: 💰 competitive salary 📈 strong equity package 🏠 [ENTITY] remote + great benefits [ENTITY]️ unlimited pto [PRODUCT] rare chance to get in at the ground level\napplication link is in the comments, please tag the perfect person for this role below 👇\nps: also looking for a cracked creative gtm pro who knows how to reach b2b buyers without making them want to delete your emails. open to fractional or agency setups.\nall gas no brakes. this is only the beginning. thank you G-d!"
  },
  {
    "id": 14,
    "text": "sometimes when we are down, all we need is a little push from our friends to get us back on track.\nwe all experience that initial rush of motivation when starting something new, then suddenly... flatline. the inspiration evaporates and we're stuck upside down, legs flailing.\nthis is where most people bail, but the successful ones? they push through that dip.\ni've been watching this play out in real time with our [LOCATION] 50 day posting challenge (hunger games). we're [ENTITY] in, and for most of the [ENTITY] participants, the honeymoon phase is over.\nthese next few weeks separate the consistent from the quitters.\nthat's why community matters so much. when motivation fades, having people who flip you right-side up makes all the difference.\nsometimes all we need is that little push from someone who sees us struggling.\ncommunity, baby. it's the difference between turtle success and turtle failure.\n[PERSON] [HANDLE] IG"
  }
]